000000* Prevent trim
       IDENTIFICATION DIVISION.
       PROGRAM-ID.
            NEWLINE_IN_CONTENTAREA.
       PROCEDURE DIVISION.

       SM301M-CONTROL.
           PERFORM SM301M-COPY.
           STOP RUN.

       SM301M-COPY.
           COPY NEWLINE_IN_CONTENTAREA.

      *TOTAL NUMBER OF FLAGS EXPECTED = 1.